// Vue组件生成catgory-list
Vue.component('cate-list', {
    props: ['cate'],
    template: '<a href="javascript:void(0);">{{cate}}</a>'
  })
  
  new Vue({
    el: '#category-list',
    data: {
      cates1: ['女装新品','商场同款','仙女连衣裙','T恤','衬衫','时髦外套','休闲裤','牛仔裤','无痕文胸','运动文胸','潮流家居服','百搭船袜'],
      cates2: ['毛呢外套','羽绒服','棉服','丝绒卫衣','毛针织衫','皮毛一体','皮草','毛衣','衬衫','针织衫','T恤','短外套','小西装','风衣'],
      cates3: ['连衣裙','半身裙','A字裙','大摆裙','包臀裙','百褶裙','长袖连衣裙','棉麻连衣裙','牛仔裤','累死连衣裙','真丝连衣裙','印花连衣裙'],
      cates4: ['休闲裤','阔腿裤','牛仔裤','开叉运动裤','哈伦裤','背带裤','小脚裤','西装裤','短裤'],
      cates5: ['时尚套装','休闲套装','日系女装','精选妈妈装','大码女装','职业套装','优雅旗袍','精致礼服','婚纱','唐装','小码女装','短外套','小西装','风衣'],
      cates6: ['光面文胸','运动文胸','美背文胸','聚拢文胸','大杯文胸','轻薄塑身'],
      cates7: ['春夏家居服','纯棉家居服','莫代尔家居服','真丝家居服','春夏睡裙','男士家居服','情侣家居服','性感睡裙'],
      cates8: ['男士内裤','女士内裤','男士内裤多条装','女士内裤多条装','莫代尔内裤'],
      cates9: ['当季新品','商场同款','印花T恤','潮流卫衣','牛仔衬衫','修身夹克','保暖棉服','棉麻面料','温暖的针织衫','修身西服','秋冬风衣','束脚裤','九分裤','破洞牛仔裤','跑步鞋','休闲鞋','篮球鞋','自行车','平衡车','帆布鞋','运动套装','运动卫衣','鱼竿','冲锋衣','跑步机','电动车'],
      cates10: ['夹克','单西','棒球服','棉衣','毛呢大衣','风衣','西服套装','羽绒服','皮衣','运动服','工装外套','针织开衫','马甲'],
      cates11: ['短袖T恤','POLO衫','短袖衬衫','背心','卫衣','针织衫/毛衣','长袖衬衫','长袖T恤'],
      cates12: ['小脚裤','九分裤','短裤','休闲裤','牛仔裤','针织衫','西裤','运动裤','工装裤'],
      cates13: ['潮牌','中老年','加大码','职场精英','中国风','情侣装'],
      cates14: ['跑步鞋','运动鞋','板鞋','潮鞋','休闲鞋','篮球鞋','足球鞋'],
      cates15: ['短袖T恤','运动裤','运动内衣','速干T恤','运动Polo','运动卫衣','运动套装','运动短裤','健身服','运动夹克'],
      cates16: ['冲锋衣','抓绒衣','登山鞋','户外休闲衣','军迷','钓鱼服'],
    }
  })